Revit 2026 API

# InCanvasControlData Class

---

Represents a collection of data which is used by [!:Autodesk::Revit::DB::TemporaryGraphicsManager] to create and update an in-canvas control.

SystemObject Autodesk.Revit.DBInCanvasControlData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InCanvasControlData : IDisposable
```
```vb
Public Class InCanvasControlData
	Implements IDisposable
```
```cpp
public ref class InCanvasControlData : IDisposable
```
```fsharp
type InCanvasControlData =
    class
        interface IDisposable
    end
```

The InCanvasControlData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InCanvasControlData(String) | Constructs an InCanvasControlData with specific values assigned. |
|  | InCanvasControlData(String, XYZ) | Constructs an InCanvasControlData with specific values assigned. |

|  | Name | Description |
| --- | --- | --- |
|  | ImagePath | The path to the image file to be used. This must be an absolute path to a location on disk. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Position | The position of the in-canvas control in model coordinates. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the InCanvasControlData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

So far, only bitmap file is supported for ImagePath. The rendered image is the same size in pixel dimensions as the original one. To get a better result, the caller should prepare the image with proper size, for exmaple: 32x32 or 64x64 in pixels, before use. To achive a "transparent" backgound color effect over the provided bitmap, the bitmap should use color RGB(0, 128, 128) as its background and it will be cleared during rendering by Revit.

#### Reference

Autodesk.Revit.DB Namespace